Revit 2027 API
Duct.CreatePlaceholder Method
 Creates a new placeholder duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Duct CreatePlaceholder(
	Document document,
	ElementId systemTypeId,
	ElementId ductTypeId,
	ElementId levelId,
	XYZ startPoint,
	XYZ endPoint
)
Public Shared Function CreatePlaceholder (
	document As Document,
	systemTypeId As ElementId,
	ductTypeId As ElementId,
	levelId As ElementId,
	startPoint As XYZ,
	endPoint As XYZ
) As Duct
public:
static Duct^ CreatePlaceholder(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ ductTypeId,
	ElementId^ levelId,
	XYZ^ startPoint,
	XYZ^ endPoint
)
static member CreatePlaceholder :
        document : Document *
        systemTypeId : ElementId *
        ductTypeId : ElementId *
        levelId : ElementId *
        startPoint : XYZ *
        endPoint : XYZ -> Duct
Parameters
document Document
 The document.
systemTypeId ElementId
 The id of the HVAC system type.
ductTypeId ElementId
 The id of the duct type.
levelId ElementId
 The level id for the duct.
startPoint XYZ
 The first point of the placeholder line.
endPoint XYZ
 The second point of the placeholder line.
Return Value
Duct
 The created placeholder duct.
Exceptions
Exception | Condition
ArgumentException |  The systemTypeId is not valid HVAC system type. -or- The duct type ductTypeId is not valid duct type. -or- The ElementId levelId is not a Level. -or- The points of startPoint and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Duct Class
Autodesk.Revit.DB.Mechanical Namespace